'''Список GPON коммутаторов'''

HUAWEI_OLT: dict[str, str] = {
    '172.16.17.232': 'Тестовая станция Huawei',
    '172.16.17.164': 'пос.Плотниково',
    '172.16.17.181': 'пос.Новостройка, с.Берёзово',
    '172.16.17.182': 'пос.Металлплощадка',
    '172.16.17.183': 'пос.Елыкаево, с.Силино',
    '172.16.17.186': 'д.Береговая, пос.Кузбасский, пос.Смирновский, с.Смолино',
    '172.16.17.188': 'г.Юрга, пос.Зимник,пос.Сарсаз',
    '172.16.32.60': 'г. Берёзовский, шахта Березовская',
    '172.16.32.61': 'г. Берёзовский, шахта Южная',
    '172.16.37.100': 'село Топки, пос.Ясногорский, с.Мазурово, д.Камышная',
    '172.16.37.223': 'пос.Пригородный',
    '172.16.37.249': 'пос.Верхотомка',
    '172.16.37.251': 'пос.Ягуновка, пос.Комиссарово',
    '172.16.37.252': 'пос.Пионер',
    '172.16.37.253': 'пос.Звёздный, д.Мозжуха',
    '172.16.40.111': 'пос.Барзас',
    '172.16.54.61': 'г.Топки',
    '172.16.56.175': 'г.Калтан, пос.Малиновка',
    '172.16.56.203': 'г.Калтан, пос.Сарбала, пос.Зелёный Луг',
    '172.16.57.210': 'Старопестерёво,Мохово,Грамотеино',
    '172.16.57.233': 'ПГТ Инской, г.Белово, д.Вишневка, ПГТ Снежинский',
    '172.16.57.234': 'пос.Старобачаты, пос.Щебзавод',
    '172.16.68.200': 'пос.Безруково, с.Боровково'
}

ELTEX_OLT: dict[str, str] = {
    '172.16.36.57': 'Инской',
    '172.16.36.58': 'Инской',
    '172.16.36.59': 'Инской',
    '172.16.42.1': 'Кемерово. Пос.Новый'
}

BDCOM_OLT: dict[str, str] = {
    '172.16.17.177': 'Металлплощадка',
    '172.16.17.178': 'Сухово',
    '172.16.17.179': 'Сухово' 
}
